<?php
return [
    //系统常用
    'lang'   => 'ko',
    '网络延迟' => '네트워크 지연',
    '参数错误' => '매개변수 오류',
    '操作频繁' => '빈번한 작업',
    '网络异常' => '네트워크 이상',
    '数据异常' => '데이터 이상',
    '成功'    => '성공',
    '数据不存在' => '데이터가 존재하지 않습니다',
    '状态异常' => '이상상태',
    '非法请求' => '불법적인 요청',
    '系统维护' => '시스템 유지 관리',
    
    //登录
    '请通过邀请链接注册登录' => '초대 링크를 통해 등록하여 로그인하십시오',
    '请输入钱包地址' => '지갑주소를 입력해주세요',
    '钱包地址不能为空' => '지갑 주소는 비워둘 수 없습니다.',
    '钱包地址有误'    => '잘못된 지갑 주소',
    '用户已被禁止登录' => '사용자의 로그인이 금지되었습니다',
    '请填写邀请码'    => '초대코드를 입력해주세요',
    '邀请码不存在'    => '초대코드가 존재하지 않습니다',
    '推荐人不存在'    => '추천인이 존재하지 않습니다.',
    
    //上传
    '请选择文件'    => '파일을 선택해주세요',
    '格式错误'    => '잘못된 형식',
    '图片大小有误'    => '이미지 크기가 잘못되었습니다.',
    
    //提币
    '余额不足' => '잔액 불충분',
    '提币数量不能为0' => '인출된 코인의 양은 0이 될 수 없습니다.',
    '提币状态1' => '검토를 보류하다',
    '提币状态2' => '성공',
    '提币状态3' => '실패하다',
    '每日提币次数' => '인출은 하루 최대 %s회까지 가능합니다.',
    'withdrawal_min' => '최소 %s 코인 인출',
    
    //PK
    '敬请期待' => '계속 지켜봐 주시기 바랍니다',
    
    '提币数量错误' => '잘못된 출금 금액',
    '提币数量整倍数' => '출금금액은 %s 의 배수입니다.',
    '请选择倍数' => '여러개를 선택해주세요',
    '抽奖次数不足' => '그리기 시간이 부족합니다',
    '请选择签到价格' => '체크인 가격을 선택해주세요',
    '未到下一次签到时间' => '다음 로그인 시간이 아직 오지 않았습니다.',
    
    '只能指定伞下用户' => '낙하산 사용자만 지정 가능',
    '不能超过自己级别' => '자기 레벨을 넘으면 안 돼요.',
    '此用户不可操作'  => '이 사용자는 작업할 수 없습니다.',
    '您已经是商家' => '당신은 이미 상인입니다',
    '您不是商家' => '당신은 상인이 아닙니다',
    '请选择购买数量' => '구매 수량을 선택하십시오.',
    '请输入赠送数量' => '증정 수량을 입력하세요',
    '赠送用户不存在' => '증정 사용자가 존재하지 않습니다',
    '不能赠送给自己' => '자기한테 줄 수 없어요.',
    
    '您已经是普通节点' => '당신은 이미 일반 노드입니다',
    '您已经是超级节点' => '당신은 이미 슈퍼노드입니다',
    '您不满足开通条件' => '활성화 조건을 충족하지 않습니다.',
    '需要算力手续费' => '컴퓨팅 파워 수수료 s%가 필요합니다',
    
    //分类1系统增加2系统扣除3余额提币4提币驳回5普通节点获得6管理级奖7超级节点获得
    'USDT类型1' => '시스템 추가',
    'USDT类型2' => '시스템 추론',
    'USDT类型3' => '잔액 인출',
    'USDT类型4' => '인출 거부됨',
    'USDT类型5' => '일반 노드',
    'USDT类型6' => '경영진 상',
    'USDT类型7' => '슈퍼 노드',
    
    //分类1系统增加2系统扣除3余额提币4提币驳回5签到获得6推荐加速7见点加速8团队加速9幸运抽奖
    'DOGBEE类型1' => '시스템 추가',
    'DOGBEE类型2' => '시스템 추론',
    'DOGBEE类型3' => '잔액 인출',
    'DOGBEE类型4' => '인출 거부됨',
    'DOGBEE类型5' => '로그인하여 받으세요',
    'DOGBEE类型6' => '추천 가속도',
    'DOGBEE类型7' => '포인트 가속도를 확인하세요',
    'DOGBEE类型8' => '팀 가속',
    'DOGBEE类型9' => '럭키드로우',
    
    //分类1系统增加2系统扣除3注册赠送4购买算力5签到扣除6推荐加速7见点加速8团队加速9积分兑换
    'POWER类型1' => '시스템 추가',
    'POWER类型2' => '시스템 추론',
    'POWER类型3' => '잔액 인출',
    'POWER类型4' => '인출 거부됨',
    'POWER类型5' => '로그인 공제',
    'POWER类型6' => '추천 가속도',
    'POWER类型7' => '포인트 가속도를 확인하세요',
    'POWER类型8' => '팀 가속',
    'POWER类型9' => '포인트 교환',
    'POWER类型10' => '출금 공제',
    'POWER类型11' => '출금 거부됨',
    
    //分类1系统增加2系统扣除3开通商家4购买积分5赠送扣除6赠送获得7兑换算力
    'POINT类型1' => '시스템 추가',
    'POINT类型2' => '시스템 추론',
    'POINT类型3' => '상가를 개통하다',
    'POINT类型4' => '포인트 구매',
    'POINT类型5' => '증정 공제',
    'POINT类型6' => '증정 획득',
    'POINT类型7' => '환전 계산력',
];
