<?php
return [
    //系统常用
    'lang'   => 'ja',
    '网络延迟' => 'ネットワーク遅延',
    '参数错误' => 'パラメータエラー',
    '操作频繁' => '頻繁な操作',
    '网络异常' => 'ネットワーク異常',
    '数据异常' => 'データ異常',
    '成功'    => '成功',
    '数据不存在' => 'データが存在しません',
    '状态异常' => '状態異常',
    '非法请求' => '不正な要求',
    '系统维护' => 'システム保守',
    
    //登录
    '请通过邀请链接注册登录' => '招待リンクから登録してください',
    '请输入钱包地址' => 'ウォレットアドレスを入力してください',
    '钱包地址不能为空' => 'ウォレットアドレスを空にすることはできません',
    '钱包地址有误'    => 'ウォレットアドレスが間違っています',
    '用户已被禁止登录' => 'ユーザーはログインを禁止されました',
    '请填写邀请码'    => '招待コードを入力してください',
    '邀请码不存在'    => '招待コードが存在しません',
    '推荐人不存在'    => '推薦者は存在しません',
    
    //上传
    '请选择文件'    => 'ファイルを選択してください',
    '格式错误'    => '間違った形式',
    '图片大小有误'    => '画像サイズが間違っています',
    
    //提币
    '余额不足' => '残高不足',
    '提币数量不能为0' => '出金するコインの量を0にすることはできません',
    '提币状态1' => '審査待ち',
    '提币状态2' => '成功',
    '提币状态3' => '失敗',
    '每日提币次数' => '引き出しは 1 日に最大 %s 回まで行えます',
    'withdrawal_min' => '%s コインの最低出金額',
    
    //PK
    '敬请期待' => '乞うご期待',
    
    '提币数量错误' => '引き出し金額が間違っています',
    '提币数量整倍数' => '引き出し金額は %s の倍数です',
    '请选择倍数' => '複数選択してください',
    '抽奖次数不足' => '描画時間が不十分',
    '请选择签到价格' => 'チェックイン料金を選択してください',
    '未到下一次签到时间' => '次のサインイン時間はまだ来ていません',
    
    '只能指定伞下用户' => '傘の下のユーザーのみ指定できます',
    '不能超过自己级别' => '自分のレベルを超えてはいけない',
    '此用户不可操作'  => 'このユーザは操作できません',
    '您已经是商家' => 'あなたはすでに商家です',
    '您不是商家' => 'あなたはビジネス家ではありません',
    '请选择购买数量' => '購入数量を選択してください',
    '请输入赠送数量' => '贈呈数量を入力してください',
    '赠送用户不存在' => '贈呈ユーザーは存在しません',
    '不能赠送给自己' => '自分に贈ってはいけない',
    
    '您已经是普通节点' => 'あなたはすでに通常のノードです',
    '您已经是超级节点' => 'あなたはすでにスーパーノードです',
    '您不满足开通条件' => '有効化条件を満たしていません',
    '需要算力手续费' => '計算能力手数料s%が必要',
    
    //分类1系统增加2系统扣除3余额提币4提币驳回5普通节点获得6管理级奖7超级节点获得
    'USDT类型1' => 'システムの追加',
    'USDT类型2' => 'システム推論',
    'USDT类型3' => '残高引き出し',
    'USDT类型4' => '撤退は拒否されました',
    'USDT类型5' => '通常ノード',
    'USDT类型6' => '管理レベル賞',
    'USDT类型7' => 'スーパーノード',
    
    //分类1系统增加2系统扣除3余额提币4提币驳回5签到获得6推荐加速7见点加速8团队加速9幸运抽奖
    'DOGBEE类型1' => 'システムの追加',
    'DOGBEE类型2' => 'システム推論',
    'DOGBEE类型3' => '残高引き出し',
    'DOGBEE类型4' => '撤退は拒否されました',
    'DOGBEE类型5' => 'ログインして',
    'DOGBEE类型6' => '推奨加速',
    'DOGBEE类型7' => 'ポイント加速を参照',
    'DOGBEE类型8' => 'チームの加速',
    'DOGBEE类型9' => 'ラッキードロー',
    
    //分类1系统增加2系统扣除3注册赠送4购买算力5签到扣除6推荐加速7见点加速8团队加速9积分兑换
    'POWER类型1' => 'システムの追加',
    'POWER类型2' => 'システム推論',
    'POWER类型3' => '残高引き出し',
    'POWER类型4' => '撤退は拒否されました',
    'POWER类型5' => 'サインイン控除',
    'POWER类型6' => '推奨加速',
    'POWER类型7' => 'ポイント加速を参照',
    'POWER类型8' => 'チームの加速',
    'POWER类型9' => 'せきぶんこうかん',
    'POWER类型10' => '引き出し控除',
    'POWER类型11' => '撤退は拒否されました',
    
    //分类1系统增加2系统扣除3开通商家4购买积分5赠送扣除6赠送获得7兑换算力
    'POINT类型1' => 'システムの追加',
    'POINT类型2' => 'システム推論',
    'POINT类型3' => '商家を',
    'POINT类型4' => 'ポイントの購入',
    'POINT类型5' => '贈与控除',
    'POINT类型6' => 'プレゼント',
    'POINT类型7' => '換算計算力',
];
