<?php
return [
    //系统常用
    'lang'   => 'zh',
    '网络延迟' => '网络延迟',
    '参数错误' => '参数错误',
    '操作频繁' => '操作频繁',
    '网络异常' => '网络异常',
    '数据异常' => '数据异常',
    '成功'    => '成功',
    '数据不存在' => '数据不存在',
    '状态异常' => '状态异常',
    '非法请求' => '非法请求',
    '系统维护' => '系统维护',
    
    //登录
    '请通过邀请链接注册登录' => '请通过邀请链接注册登录',
    '请输入钱包地址' => '请输入钱包地址',
    '钱包地址不能为空' => '钱包地址不能为空',
    '钱包地址有误'    => '钱包地址有误',
    '用户已被禁止登录' => '用户已被禁止登录',
    '请填写邀请码'    => '请填写邀请码',
    '邀请码不存在'    => '邀请码不存在',
    '推荐人不存在'    => '推荐人不存在',
    
    //上传
    '请选择文件'    => '请选择文件',
    '格式错误'    => '格式错误',
    '图片大小有误'    => '图片大小有误',
    
    //提币
    '余额不足' => '余额不足',
    '提币数量不能为0' => '提币数量不能为0',
    '提币状态1' => '待审核',
    '提币状态2' => '成功',
    '提币状态3' => '失败',
    '每日提币次数' => '每日提现最多%s次',
    'withdrawal_min' => '%s个币起提',
    
    //PK
    '敬请期待' => '敬请期待',
    
    '提币数量错误' => '提币数量错误',
    '提币数量整倍数' => '提币数量为%s的倍数',
    '请选择倍数' => '请选择倍数',
    
    '赠送用户不存在' => '赠送用户不存在',
    '不能赠送给自己' => '不能赠送给自己',
    
    '请选择入场券' => '请选择入场券',
    '请选择挖矿记录' => '请选择挖矿记录',
    '当前不可赎回' => '当前不可赎回',
    '您已经是节点' => '您已经是节点',
    '库存不足' => '库存不足',
    '请输入充值金额' => '请输入充值金额',
    '请输入目标地址' => '请输入目标地址',
    '此入场券不可赠送' => '此入场券不可赠送',
    '订单已赎回' => '订单已赎回',
    '入场券状态已更新' => '入场券状态已更新',
    
    //分类1系统增加2系统扣除3余额提币4提币驳回5余额充值6购买入场券7支付保证金8赎回保证金9开通节点12直推奖励13层级奖励14静态奖励15等级奖励16精英分红17核心分红18创世分红19排名分红
    'USDT类型1' => '系统增加',
    'USDT类型2' => '系统扣除',
    'USDT类型3' => '余额提币',
    'USDT类型4' => '提币驳回',
    'USDT类型5' => '余额充值',
    'USDT类型6' => '购买入场券',
    'USDT类型7' => '支付保证金',
    'USDT类型8' =>'赎回保证金',
    'USDT类型9' =>'开通节点',
    'USDT类型12' =>'直推奖励',
    'USDT类型13' =>'层级奖励',
    'USDT类型14' =>'静态奖励',
    'USDT类型15' =>'等级奖励',
    'USDT类型16' =>'精英分红',
    'USDT类型17' =>'核心分红',
    'USDT类型18' =>'创世分红',
    'USDT类型19' =>'排名分红',
];
