<?php
return [
    //系统常用
    'lang'   => 'zh',
    '网络延迟' => '網絡延遲',
    '参数错误' => '參數錯誤',
    '操作频繁' => '操作頻繁',
    '网络异常' => '網絡異常',
    '数据异常' => '數據異常',
    '成功'    => '成功',
    '数据不存在' => '數據不存在',
    '状态异常' => '狀態異常',
    '非法请求' => '非法請求',
    '系统维护' => '系統維護',
    
    //登录
    '请通过邀请链接注册登录' => '請通過邀請鏈接註冊登錄',
    '请输入钱包地址' => '請輸入錢包地址',
    '钱包地址不能为空' => '錢包地址不能為空',
    '钱包地址有误'    => '錢包地址有誤',
    '用户已被禁止登录' => '用戶已被禁止登錄',
    '请填写邀请码'    => '請填寫邀請碼',
    '邀请码不存在'    => '邀請碼不存在',
    '推荐人不存在'    => '推薦人不存在',
    
    //上传
    '请选择文件'    => '請選擇文件',
    '格式错误'    => '格式錯誤',
    '图片大小有误'    => '圖片大小有誤',
    
    //提币
    '余额不足' => '余額不足',
    '提币数量不能为0' => '提幣數量不能為0',
    '提币状态1' => '待審核',
    '提币状态2' => '成功',
    '提币状态3' => '失敗',
    '每日提币次数' => '每日提現最多%s次',
    'withdrawal_min' => '%s個幣起提',
    
    //PK
    '敬请期待' => '敬請期待',
    
    '提币数量错误' => '提幣數量錯誤',
    '提币数量整倍数' => '提幣數量為%s的倍數',
    '请选择倍数' => '請選擇倍數',
    
    '赠送用户不存在' => '贈送用戶不存在',
    '不能赠送给自己' => '不能贈送給自己',
    
    '请选择入场券' => '請選擇入場券',
    '请选择挖矿记录' => '請選擇挖礦記錄',
    '当前不可赎回' => '當前不可贖回',
    '您已经是节点' => '您已經是節點',
    '库存不足' => '庫存不足',
    '请输入充值金额' => '請輸入充值金額',
    '请输入目标地址' => '請輸入目標地址',
    '此入场券不可赠送' => '此入場券不可贈送',
    '订单已赎回' => '訂單已贖回',
    '入场券状态已更新' => '入場券狀態已更新',
    
    '此NFT不可合成升级' => '此NFT不可合成升級',
    'NFT数量不足' => 'NFT數量不足',
    '今日已签到' => '今日已簽到',
    
    //分类1系统增加2系统扣除3余额提币4提币驳回5团队返利GAS6手续费分红
    'USDT类型1' => '系統增加',
    'USDT类型2' => '系統扣除',
    'USDT类型3' => '余額提幣',
    'USDT类型4' => '提幣駁回',
    'USDT类型5' => '團隊返利GAS',
    'USDT类型6' => '手續費分紅',
    
    //分类1系统增加2系统扣除3余额提币4提币驳回5锁仓释放6推荐奖励
    'JUJ类型1' => '系統增加',
    'JUJ类型2' => '系統扣除',
    'JUJ类型3' => '余額提幣',
    'JUJ类型4' => '提幣駁回',
    'JUJ类型5' => '鎖倉釋放',
    'JUJ类型6' => '推薦獎勵',
    
    //来源1注册赠送2合成获得3签到获得4平台购买5推荐获得6合成扣除7签到扣除
    'NFT类型1' => '註冊贈送',
    'NFT类型2' => '合成獲得',
    'NFT类型3' => '簽到獲得',
    'NFT类型4' => '平臺購買',
    'NFT类型5' => '推薦獲得',
    'NFT类型6' => '合成扣除',
    'NFT类型7' => '簽到扣除',
];
